blog/app/views/blogs/index.html.erb

      <main><%= markdown(blog_post.post) %></main><br>
      <% kilo = blog_post.comments.count.to_s + ' comments' %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 26]]