blog/app/views/blogs/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 25]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."blog_id" = ?  [["blog_id", 22]]
---

    <h3><%= @blog.comments.count%> Comments</h3>