blog/app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.page(params[:page]).per(2).order('created_at DESC')
---
SELECT  "blogs".* FROM "blogs" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"

  def create
    @blog = Blog.new(blog_params)

    if @blog.save
---
INSERT INTO "blogs" ("title", "category", "author", "post", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "1"], ["category", "1"], ["author", "1"], ["post", "11111"], ["created_at", 2017-02-07 07:00:16 UTC], ["updated_at", 2017-02-07 07:00:16 UTC]]

  def update
    @blog = Blog.find(params[:id])

    if @blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "Blog Post 1"], ["category", "rant"], ["updated_at", 2017-02-07 13:41:59 UTC], ["id", 13]]

  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 8]]