blog/app/controllers/comments_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def index
    @comments = Blog.find(params[:id]).Comment.all

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @blog = Blog.find(params[:blog_id])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."blog_id" = ? AND "comments"."id" = ? LIMIT ?  [["blog_id", 22], ["id", 15], ["LIMIT", 1]]
---
  def edit
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.find(params[:id])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "comments" SET "remark" = ?, "email" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["remark", "dlfksjlsf"], ["email", "sdfssfd"], ["updated_at", 2017-02-10 01:54:58 UTC], ["id", 27]]
---
  def update
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.find(params[:id])

    if @comment.update(comment_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "remark", "blog_id", "email", "user") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", 2017-02-09 07:33:28 UTC], ["updated_at", 2017-02-09 07:33:28 UTC], ["remark", "remark"], ["blog_id", 25], ["email", "email"], ["user", "user"]]
---
  def create
    blog = Blog.find(params[:blog_id])
    @comment = blog.comments.create(comment_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."blog_id" = ? AND "comments"."id" = ? LIMIT ?  [["blog_id", 25], ["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]
---
  def destroy
    blog = Blog.find(params[:blog_id])
    @comment = blog.comments.find(params[:id])
    @comment.destroy